# CV API SYSTEM



## 1. Εισαγωγή

Το API σύστημα των Κοινών Επισκέψεων (ΚΕ) Common Visits (CV) δίνει την δυνατότητα διασύνδεσης του συστήματος ΚΕ με άλλες εταιρείες και ομάδας. Προσφέρει την δυνατότητα να ενσωματώνεται με τα συστήματα των χρηστών, ή πάνω σε αυτό να αναπτυχθούν και ανεξάρτητα συστήματα.

Για παράδειγμα αν θέλει κάποιος να χρησιμοποιήσει το API αυτό στο ΔΕΤΕΠ ή στο TFO θα πρέπει να κάνει τα ανάλογα προγράμματα που θα επιτρέπουν στους χρήστες των συγκεκριμένων συστημάτων να έχουν τις νέες δυνατότητες. Ή να αναπτύξει ξεχωριστό πρόγραμμα Διεπαφής Χρήστη (User Interface = UI).

Το σύστημα εκτός από API διαθέτει και κανονικές ιστοσελίδες για την διαχείρισή της βάσης δεδομένων των ΚΕ και των χρηστών. Οι ιστοσελίδες μπορούν να επεκταθούν και να καλύψουν τις ανάγκες για UI, αν χρειαστεί, είτε με την χρήση των API ή με την αμεσότερη σύνδεση με την βάση δεδομένων.

## 2. Διασύνδεση με άλλα συστήματα

Τα αντικείμενα που βρίσκονται στο TFO, όπως είναι οι αιτήσεις για υπηρεσίες και βλάβες και οι διευθύνσεις και κυκλώματα δίνονται από προσωρινό βοηθητικό ανεξάρτητο API σύστημα το οποίο αντικαθιστά προς το παρόν το κανονικό που θα πρέπει να ζητηθεί να γίνει. Η χρήση του συγκεκριμένου εξωτερικού API επιτρέπει τόσο την αυτοματοποίηση των αιτήσεων όσο και την επικοινωνία των Παρόχων με την Cyta μόνο με ένα κωδικό στην κάθε περίπτωση ΚΕ. <span style="color:red"> Το API αυτό θα πρέπει να αντικατασταθεί με το API του TFO όταν αυτό θα ζητηθεί και θα είναι έτοιμο. Οι προδιαγραφές τους είναι αυτές που χρησιμοποιήθηκαν στο προσωρινό API. </span>

Οι χρήστες τόσο των Παρόχων όσο και της Cyta μπαίνουν στο σύστημα και άρα το σύστημα μπορεί να τους βλέπει ως αντικείμενα, για εύκολη αναφορά. 

Το σύστημα είναι έτοιμο να καταναλωθεί από άλλα συστήματα, όπως αυτά των Παρόχων. 


## 3. Χρήστες των Συστημάτων Διαχείρισης και API

### 3.1 Σύστημα API 
Το σύστημα API είναι αυτό που ανταλλάζει εντολές και συνδέει τους Παρόχους με την Cyta και τις διάφορες ομάδες της. Αυτές οι οντότητες πρέπει να έχουν ένα password για να μπορούν να ανταλλάζουν μηνύματα μέσω του API.

Είναι ευθύνη της κάθε ομάδας και εταιρείας που θα συνδεθεί πάνω στο API σύστημα, για το πως θα δίνει διάφορα δικαιώματα στους υπαλλήλους της, μέσα από το UI που η ίδια θα αναπτύξει. 

Παρόλα αυτά στο API σύστημα μπήκαν δύο ομάδες χρηστών για να δειχθεί η ικανότητά του να χειρίζεται διάφορα permissions. Η μια ομάδα μπορεί να δημιουργήσει νέες ΚΕ, ενώ η άλλη δεν μπορεί.

Φυσικά στο τελικό σύστημα όλες οι ομάδες και εταιρείες που θα είναι χρήστες του συστήματος θα έχουν όλες τις δυνατότητες του API.

Το UI σύστημα έχει επεκταθεί και καλύπτει με ιστοσελίδες όλες τις λειτουργίες των ΚΕ και μπορεί να χρησιμοποιηθεί άμεσα τόσο από τις ομάδες της Cyta όσο και από τους Παρόχους. Να σημειωθεί ότι το UI παρακάμπτει τα API και συνεργάζεται απευθείας με την βάση δεδομένων του συστήματος. Περιγραφή του συγκεκριμένου UI υπάρχει σε άλλο κείμενο το οποίο μπορείτε να βρείτε στο μενού του παρόντος συστήματος.

Οι χρήστες του API και του UI είναι ίδιοι και μπορούν να εκτελούν τα καθήκοντά τους με βάση τα δικαιώματα που τους δίνονται. Σε κάθε Πάροχο θα δίνεται ένας διαχειριστής χρηστών του. Το σύστημα θα είναι ανοιχτό για πρόσβαση μόνο από μικρό αριθμό white list IP. Γι' αυτό η πρόσβαση από τις διάφορες ομάδες πρέπει να γίνεται μέσω εταιρικών VPN. Τα ALLOWED_IPS καθορίζονται στα settings του συστήματος.


### 3.2 Σύστημα Διαχείρισης Χρηστών

Η διαχείριση των χρηστών γίνεται μέσα από ιστοσελίδες user panel. 

Υπάρχουν δύο permissions ένα για να μπορεί κάποιος ή όχι να κάνει νέες ΚΕ και ένα άλλο να μπορεί να διαχειρίζεται τους χρήστες της ομάδας του. Δεν υπάρχει στόχος να περιοριστεί ο αριθμός των χρηστών που θα κάνουν ΚΕ, όμως η δυνατότητα αυτή υπάρχει για το ενδεχόμενο κάποιος να την χρησιμοποιήσει.

Η δυνατότητα διαχείρισης χρηστών μιας ομάδας ή παρόχου δίνεται με ειδικό permission και γι' αυτό η κάθε ομάδα πρέπει να ζητήσει τουλάχιστον ένα λογαριασμό με αυτό το δικαίωμα.

Οι χρήστες πέραν του πιο πάνω permission έχουν χαρακτηριστικά που τους επιτρέπουν να διαφοροποιούνται οι ρόλοι τους μέσα στην εφαρμογή. Για παράδειγμα αν ανήκει σε επαρχία (district), περιορίζονται οι ρόλοι του στην επαρχία. Αν ανηκει σε συνεργείο (workshop) έχει την δυνατότητα να συμπληρώνει τα επιτόπου (onsite) στοιχεία της ΚΕ.

Στο παρόν στάδιο οι χρήστες γενικά μπορούν να αλλάζουν το password τους. Αν το ξεχάσουν θα ζητούν από τον διαχειριστή χρηστών της ομάδας τους να τους βάλει κάποιο προσωρινό password. Στο μέλλον θα εξεταστεί αν θα εισαχθεί μηχανισμός αλλαγής (reset) password από τους ίδιους τους χρήστες μέσω email.

**Προσοχή:** Οι χρήστες μέσα από το API δεν διαφοροποιούνται παρά μόνο αν έχουν το δικαίωμα να κάνουν ή όχι ΚΕ. Να σημειωθεί ότι στο κανονικό σύστημα οι χρήστες του API δεν έχουν τον περιορισμό αυτό ή οποιοδήποτε άλλο περιορισμό, εκτός από την λογική της διαχείρισης των ΚΕ. Αν κάποια ομάδα/πάροχος θέλει το σύστημά τους να κάνει consume τα API των ΚΕ, θα χρησιμοποιεί ένα λογαριασμό και οι χρήστες τους θα δον διαμοιράζονται με τα δικαιώματα που θα καθορίζει η ομάδα τους. 

Οι χρήστες που θα μπορούν να χρησιμοποιήσουν (consume) τα API έχουν εδικό δικαίωμα που τους δίνεται μέσα από το administration panel της Cyta. Η κάθε ομάδα που θέλει να χρησιμοποιήσει τα API πρέπει να ζητήσει να της δοθεί ένας τέτοιος λογαριασμός χρήστη.


### 3.3 Σύστημα Διαχείρισης ΚΕ

Η διαχείριση του συστήματος γίνεται μέσα από ιστοσελίδες admin panel.

Υπάρχει ένα γκρουπ χρηστών της Cyta με ειδικά δικαιώματα διαχείρισης των ΚΕ το οποίο ονομάζεται Reviewers οι οποίοι μπορούν να κάνουν αλλαγές πάνω στα CV, χωρίς περιορισμούς από την λογική του προγράμματος.

Δηλαδή ένας Reviewer μπορεί να αλλάξει την κατάσταση μιας ΚΕ και να την κάνει για παράδειγμα να ξεκινά από την αρχή, άσχετα αν έχει κλείσει ή έχει απορριφθεί. Μπορεί να αλλάξει τον τύπο μιας ΚΕ από Επιθεώρηση σε Βλάβη κτλ. Γενικά μπορεί να αλλάζει τα πάντα πάνω στα CV.

Ένας Reviewer μπορεί να βλέπει τους χρήστες του συστήματος αλλά δεν μπορεί να τους αλλάξει τα στοιχεία τους. Η ιστοσελίδα για τους Reviewers είναι ένα μέρος από το Admin Panel και βρίσκεται στην διεύθυνση <https://visit-api.chrysochos.net/cv_admin>. Στους Reviewers θα μπαίνουν μόνο χρήστες της Cyta και σε πάρα πολύ μικρό και ελεγχόμενο αριθμό.

Στο κεντρικό Admin Panel που είναι στο <https://visit-api.chrysochos.net/admin> μπορούν να μπαίνουν οι χρήστες της Cyta που είναι superuser, οι οποίοι έχουν ακόμη περισσότερες δυνατότητες παρέμβασης στο σύστημα και μπορούν να σβήνουν ΚΕ να εισάγουν νέους χρήστες και γενικά να ελέγχουν την βάση δεδομένων του συστήματος.

Οι supervisor μπορούν να διαγράψουν μια ή όλες τις ΚΕ, και άρα γίνεται αντιληπτό ότι ο ρόλος αυτός θα είναι για πάρα-πάρα πολύ λίγους.

Οι superuser εισάγουν χρήστες στο σύστημα και τους δίνουν δικαιώματα καθώς και αρχικό password. (<span style="color:red"> Πρέπει να ανοίξουμε τον μηχανισμό αλλαγής password από τους χρήστες ή θα τους το αλλάζουν οι διαχειριστές χρηστών  μόνο;</span>). Ο αριθμός των superuser θα είναι πάρα πολύ περιορισμένος και σίγουρα δεν θα είναι καθημερινοί χρήστες. Φυσικά θα είναι υπάλληλοι της Cyta. Θέλει ιδιαίτερη προσοχή ο ρόλος αυτός διότι μπορεί να αλλοιώσει δεδομένα και να δώσει ή να αφαιρέσει δικαιώματα.

Φυσικά πάνω από όλους τους ρόλους υπάρχει ο συντηρητής του λογισμικού που μπορεί να ελέγξει τα πάντα πάνω στο σύστημα.

Να σημειωθεί ότι και όλοι οι χρήστες του συστήματος μπορούν να στέλνουν API εντολές. Αυτό τους επιτρέπει να κάνουν δοκιμές και ελέγχους. Φυσικά οι εντολές που στέλνουν θα είναι περιορισμένες από τα δικαιώματα που έχουν.

## 4. Δοκιμές Συστήματος

Για τις δοκιμές του συστήματος δημιουργήθηκαν πρέπει να αποταθείτε στην ΕΧΑ. Οι προσβάσεις που δίνονται στους χρήστες είναι μόνο αυτοί που αντιστοιχούν στον ρόλο τους. Γι' αυτό πέραν των προσβάσεων σε  περίπτωση που θέλει κάποιος να κάνει δοκιμές πρέπει να μιλήσει με την ΕΧΑ για να του δοθεί άτομο με το οποίο θα κάνει τις δοκιμές για ολόκληρο τον κύκλο ζωής των ΚΕ.

Λόγω του ότι εισάγονται στο σύστημα τα μέλη του κάθε Παρόχου, δίνεται και η αντίστοιχη διαχείριση των χρηστών για τους Παρόχους. Αυτό σημαίνει ότι κάποιος χρήστης του κάθε Παρόχου θα μπορεί να διαχειρίζεται τους χρήστες του μέσα από το UI που θα δοθεί. 

## 5 Καθοδήγηση από το σύστημα για ολοκλήρωση των σταδίων μιας ΚΕ

Το σύστημα όταν απορρίπτει κάποιο αίτημα (request), στην απάντησή του (response) δίνει τον λόγο. Έτσι με τον τρόπο αυτό ο χρήστης μπορεί να μάθει πως δουλεύει το API. Φυσικά η ορθότερη λύση είναι να υπάρχει οδηγός χρήσης και γι' αυτό υπάρχει το κείμενο αυτό.

Για παράδειγμα όταν ένας μη χρήστης (χωρίς login) πάει να δημιουργήσει ένα CV, το σύστημα θα του πει ότι δεν τον γνωρίζει. Αν ο χρήστης έχει κάνει login, αλλά δεν έχει δικαίωμα δημιουργίας CV, θα του το αναφέρει. Αν έχει δικαίωμα να κάνει CV και έχει ξεχάσει να βάλει κάποιο απαραίτητο στοιχείο, για παράδειγμα την Διεύθυνση, θα του το αναφέρει.

Με την δημιουργία ενός CV αυτό βρίσκεται σε κατάσταση Pending. Ο οργανισμός που δημιουργεί την ΚΕ ονομάζεται Requestor και ο οργανισμός που το παραλαμβάνει ονομάζεται Acceptor. Ο Acceptor μπαίνει στο σύστημα και βλέπει αν έχει Pending CV και τα αποδέχεται (Accepted) ή τα απορρίπτει (Rejected).

Τα Accepted CV την ημέρα που είναι προγραμματισμένα με μια εντολή Execute, η οποία θα τρέχει αυτόματα κάθε πρωί (αλλά στο αρχικό στάδιο θα δίνεται με το χέρι), όσα CV είναι Accepted και έχουν δηλωμένα τα άτομα από τους δύο οργανισμούς που θα είναι στην επιτόπου συνάντηση αποδεσμεύονται προς εκτέλεση (Execution).

Το συνεργείο όταν συμπληρώσει την φόρμα και αυτή περάσει το validation, μετατρέπει το CV από Execution σε Completed.

Ένα CV μπορεί να γίνει Cancel από τον Requestor και Rejected από τον Acceptor.

Επιπρόσθετα μπορεί να ζητήσει κάποιος από τους δύο οργανισμούς η συνάντηση να γίνει σε διαφορετική ημερομηνία.

Οι υπάλληλοι των δύο οργανισμών που θα είναι στην συνάντηση μπορούν να αλλάζουν οποτεδήποτε αυτοί και ο οργανισμός τους το θέλουν.

Λεπτομερείς για τις διαδικασίες των ΚΕ φαίνονται στην πιο κάτω εικόνα, όπου παρουσιάζεται η μηχανή καταστάσεων (state even machine) που έγινε και ελέγχθηκε με το εργαλείο Xstate της <https://stately.ai/>.


<img src='/static/cv-cycle.png' alt="CV States" width=100%>

Εικόνα 1: Εντολές και Καταστάσεις Συστήματος API Κ.

## 6. Σύντομοι κωδικοί που χρησιμοποιούνται στο API

Στο body των Http request και response του API μεταφέρονται δεδομένα που σχετίζονται με τα δεδομένα που διατηρούνται στην βάση δεδομένων του συστήματος. Μερικά από τα δεδομένα είναι τυποποιημένα και έχουν συντομογραφικούς αριθμούς, όπως πιο κάτω.

**Status:** 1 Pending, 2 Accepted, 3 Rejected. 4 Cancelled, 5 DateExam, 6 Execution, 7 Completed.

**Reasons:** 1 ΔΕΝ ΜΠΟΡΕΙ ΝΑ ΕΝΤΟΠΙΣΕΙ ΤΟ ΥΠΟΣΤΑΤΙΚΟ, 2 ΔΕΝ ΥΠΑΡΧΕΙ ΠΡΟΣΒΑΣΗ, 3 ΔΕΝ ΥΠΑΡΧΕΙ ΠΡΟΣΒΑΣΗ - ΠΡΟΒΛΗΜΑ ΣΤΟ ΠΡΑΚΕΤΟ, 4 ΔΕΥΤΕΡΗ ΚΑΤΑΧΩΡΗΣΗ ΒΛΑΒΗΣ, 5 ΧΩΡΙΟ Η ΠΕΡΙΟΧΗ ΧΩΡΙΣ ΔΙΕΥΘΥΝΣΕΙΣ, 6 ΧΩΡΙΣ ΝΑ ΔΙΕΥΚΡΙΝΙΖΕΙ ΛΟΓΟ.

**Productcategory:** 1 LLU, 2 ND, 3 FΑ.

**Operators:** 1 Cyta, 2 Primetel, 3 Epic, 4 Cablenet, 5 Logosnet, 6 ShortCircuit, 7 Kernel.

**Districts:** 2 Nicosia, 3 Famagusta, 4 Larnaca, 5 Limassol, 6 Paphos.

**CV types:** 1 Installation, 2 Indication, 3 Fault, 4 Survey.

Πρέπει να βάζετε τους κατάλληλους αριθμούς στα body των request για τα πιο πάνω field.

## 7. Εντολές δημιουργίας και εμφάνισης των CV

### 7.1 Εντολή δημιουργίας CV

Η δημιουργία μιας ΚΕ ξεκινά από το CV όπου συμπληρώνεται η επικεφαλίδα από τον οργανισμό που θέλει να γίνει η ΚΕ. Υπάρχει μια εντολή **"new\_cv"** για την δημιουργία CV, που καλύπτει την Cyta και τους Παρόχους καθώς και όλους τους τύπους ΚΕ. Η εντολή αυτή ενεργοποιεί την αποστολή ερώτησης σε άλλο σύστημα (TFO) για να πάρει συμπληρωματικά στοιχεία που απαιτούνται στη συμπλήρωση της αίτησης. <span style="color:red">Προς το παρόν αυτό γίνεται με ξεχωριστό web service σύστημα που βρίσκεται στον ίδιο υπολογιστή στην εσωτερική διεύθυνση 127.0.0.1:8001

Όπως αναφέρθηκε στο εισαγωγικό κείμενο, ένας χρήστης μπορεί να δημιουργήσει ΚΕ μέσα στο σύστημα μόνο αν ανήκει στην ομάδα με το permission CAN ADD CV. Όλοι οι χρήστες παίρνουν αυτή την δυνατότητα. Ο μηχανισμός μπήκε σε περίπτωση που απαιτηθεί να είναι έτοιμος.

Αν ο χρήστης δεν ανήκει στην ομάδα που μπορεί να κάνει CV, και στείλει εντολή για δημιουργία μιας ΚΕ, θα πάρει σχετική αρνητική απάντηση από το σύστημα. Σε περίπτωση που σταλεί κάτι ασυμπλήρωτο το σύστημα ενημερώνει τον αιτητή για να κάνει την διόρθωση. Κάποια πεδία έχουν αριθμούς οι οποίοι αντιστοιχούν με ονόματα Παρόχων, Επαρχιών κτλ. Οι σχετικοί πίνακες για την μετάφραση των αριθμών αυτών υπάρχουν στο τέλος του εισαγωγικού κειμένου.

Ο χρήστης ανάλογα με τον ρόλο που θέλει να παίξει πρέπει να βάζει το ανάλογο username και password, όπως αυτό εξηγείται στην εισαγωγική περιγραφή, στο Authorization-\> Basic Auth του κάθε request.

Στο Body του request μπαίνουν τα στοιχεία που θέλουμε να γραφτούν στο CV. Το \"status\": 1, είναι το πρώτο status που παίρνει ένα CV και σημαίνει Pending, διότι περιμένει έγκριση από τον άλλο οργανισμό.

Κατά την δημιουργία του CV κάποια πεδία συμπληρώνονται αυτόματα, όπως είναι ο creator, και requestor.

Για να στείλετε μια POST εντολή για την δημιουργία ενός CV, χρειάζεται να υπάρχει μια ιστοσελίδα που να έχει τα απαραίτητα στοιχεία σε φόρμα, ή να χρησιμοποιηθεί ειδικό πρόγραμμα για χρήση των API όπως είναι το Postman (<https://www.postman.com/>) και SoapUI (που χρησιμοποιείται στην Cyta). Το Postman μπορείτε να τον χρησιμοποιήσετε από το διαδίκτυο ή να τον κατεβάσετε δωρεάν για την απλή χρήση που κάνουμε.

Με τα προγράμματα αυτά υπάρχει η ευχέρεια να στέλνετε ότι θέλετε για να κάνετε διάφορες δοκιμές. Ακόμη αποθηκεύουν τις εντολές για πολλαπλή χρήση, ή και εύκολη τροποποίησή τους.

Για την περίπτωση της δημιουργίας μιας Τεχνικής ΚΕ μπορείτε με το Postman να στείλετε εντολή POST στην διεύθυνση {{url}}\api\new_cyta_tech (όπου url είναι η διεύθυνση του API), νοουμένου ότι έχετε καθορίσει BasicAuth με username και password και φυσικά στο body έχετε βάλει τα στοιχεία της επικεφαλίδας της ΚΕ που απαιτούνται στην κάθε περίπτωση.

Ένα μικρότερο εργαλείο για έλεγχο του API υπάρχει στην ιστοσελίδα <https://visit-api.chrysochos.net/api/schema/swagger-ui/>. Το swagger-ui καλύπτει σε μεγάλο βαθμό τις διάφορες εντολές και γι' αυτό κάποιος μπορεί να το χρησιμοποιήσει, για να δει το σύστημα αρχικά. Υπάρχουν κάποιες περιπτώσεις που δεν καλύπτονται από το swagger-ui, όπως είναι το φιλτράρισμα της λίστας των ΚΕ, διότι πρέπει να σταλούν διάφοροι παράμετροι των φίλτρων στο URL. Πρέπει να γίνει μια μικρή μελέτη του swagger-ui για να βάλουμε και τις πρόσθετες παραμέτρους στην αυτόματη τεκμηρίωση https://drf-spectacular.readthedocs.io/en/latest/customization.html.

Η τεκμηρίωση έγινε αυτόματα με την πιο κάτω εντολή του συστήματος ανάπτυξης Django:

    ./manage.py spectacular --file schema.yaml --validate

Με το swagger-ui μπορείτε να κάνετε ένα POST API και έτσι να δημιουργήσετε ένα νέο CV. Πατήστε το «Try it out" και θα μπορείτε να αλλάξετε τα δεδομένα της επικεφαλίδας μιας ΚΕ πριν την στείλετε στο σύστημα. Αν σας ζητήσει να κάνετε login διαλέξετε ένα username της Cyta ή κάποιου Παρόχου για να εκτελέσετε αντίστοιχες ενέργειες.

Η εντολή για την δημιουργία ενός CV **"new\_cv"** είναι πολύ απλή και αποστέλλεται με POST. Προσέχετε τις περισσότερες φορές οι εντολές θέλουν τελικό / στην διεύθυνση.

Όταν θα στείλετε την εντολή και πάρετε το response, κοιτάξετε το id που έχει επιστραφεί. Αν δημιουργήσετε ακόμη μια καινούρια ΚΕ, κοιτάξετε ξανά το id ότι έχει αυξηθεί και ότι φυσικά το response έχει τα δεδομένα που στείλατε.

Για να μπορείτε να έχετε πέραν του ενός λογαριασμού ανοιχτούς στο σύστημα, μπορείτε να χρησιμοποιήσετε διαφορετικούς browsers ή να χρησιμοποιήσετε το Postman. Επίσης μπορείτε να χρησιμοποιήσετε το SessionBox ως πρόσθετο στον browser σας. **Με το addon SessionBox μπορείτε να έχετε πολλαπλούς λογαριασμούς ανοιχτούς στον ίδιο browser.**

### 7.2 Λήψη λίστας CV

Στην διεύθυνση {{url}}/api/, δηλαδή στην <https://visit-api.chrysochos.net/api/> ο χρήστης μπορεί να στείλει την εντολή GET, και θα πάρει μια λίστα με τις ΚΕ που βρίσκονται στο σύστημα και αφορούν την εταιρεία του ως requestor ή ως acceptor. Η λίστα παρουσιάζει τα πιο σημαντικά στοιχεία της ΚΕ, όπως είναι η ημερομηνία, η κατάσταση, ο οργανισμός που την έχει δημιουργήσει και ο οργανισμός που την έχει αποδεχθεί. Στην επόμενη ενότητα θα δούμε την εντολή για να πάρουμε τις λεπτομέρειες μιας ΚΕ. 

Σε περίπτωση που ο χρήστης δεν έχει κάνει προηγούμενα login στο σύστημα θα του ζητήσει να το κάνει.

Όταν ο χρήστης πάρει την απόκριση από το σύστημα, θα δει ότι τα CV έρχονται σελίδα-σελίδα. Ο μηχανισμός αυτός ονομάζεται paging και χρησιμοποιείται για να μην φορτίζεται ο server και ο client με πάρα πολλά στοιχεία. Στην αρχή της κάθε σελίδας υπάρχουν βοηθητικά link για επόμενη και προηγούμενη σελίδα.

Με την εντολή <https://visit-api.chrysochos.net/api/?page=4? βλέπουμε την τέταρτη σελίδα των αποτελεσμάτων. Να σημειωθεί ότι ο αριθμός των CV που εμφανίζονται στην κάθε σελίδα καθορίζεται μέσα από το πρόγραμμα και δεν μπορείτε να τον αλλάξετε στο παρόν στάδιο.

Εκτός από το paging υπάρχει και μηχανισμός φίλτρων. Στην παρούσα φάση τα φίλτρα καλύπτουν τα πιο κάτω πεδία.

            'status'
            'requestor'
            'acceptor'
            'district'
            'cv_date'
            'tfo_request'
            'circuit_number'
            'circuit_order_number'
            'email.

Δηλαδή μεταξύ άλλων καλύπτουν το όνομα του οργανισμού και αυτού που αποδέχεται το αίτημα της ΚΕ, την κατάσταση στην οποία βρίσκεται μια ΚΕ, την Επαρχία που αφορά και την ημερομηνία πραγματοποίησης της ΚΕ.

Το φίλτρο του email του συνεργείου είναι πολύ σημαντικό για τον εντοπισμό των ΚΕ από τα συνεργεία. Παρότι υπάρχουν δύο email για τα δύο συνεργεία του Παρόχου και της Cyta, έχει δημιουργηθεί το φίλτρο email έτσι που να καλύπτει και τα δύο πεδία της βάσης δεδομένων.

Για το φίλτρο της ημερομηνίας υπάρχει η δυνατότητα να ζητήσουμε συγκεκριμένη ημερομηνία ή να δημιουργήσουμε ανοιχτά ή κλειστά χρονικά διαστήματα με τις εντολές gte και lte, όπως θα δούμε στο πιο κάτω παράδειγμα.

Στο πιο κάτω παράδειγμα βλέπουμε διάφορα φίλτρα και ordering.

<https://visit-api.chrysochos.net/api/?acceptor=1&cv_date__gte=2023-08-15&ordering=-cv_date&requestor=2&status=1.

Εδώ πρέπει να δείτε το θέμα της ημερομηνίας που γράφεται ως cv_date\_\_gte, δηλαδή δύο λέξεις ενωμένες με διπλό \_. Το δεύτερο συνθετικό μπορεί να είναι gte ή lte για μικρότερες και μεγαλύτερες ημερομηνίες. Σε περίπτωση που θέλουμε να βρούμε ΚΕ μιας ημέρας μόνο τότε χρησιμοποιείται το "=". Ακόμη πρέπει να προσέξετε το - στο ordering το οποίο κάνει φθίνουσα ταξινόμηση.

Να σημειωθεί ότι το λογισμικό έχει προγραμματιστεί να το βάζει μόνο του default ordering για την ημερομηνία cv_date που προγραμματίσθηκε η ΚΕ. Αυτό βοηθά και στο paging για να μην ξεχαστεί κάτι όταν βλέπουμε την λίστα των ΚΕ από την μια σελίδα στην άλλη.

Φυσικά όλα αυτά τα δύσκολα φίλτρα κτλ θα τα βάζει αυτόματα το πρόγραμμα διεπαφής του χρήστη (UI) το οποίο θα δούμε σε άλλη μελέτη.

Οι Πάροχοι δεν θα βλέπουν το onsite χρήστη της Cyta, και αυτό γίνεται διότι είναι το συνεργείο της Cyta που θα τηλεφωνήσει στο συνεργείο του Παρόχου για την ΚΕ. <span style="color:red">Αυτό πρέπει να γίνει και στο UI</span>

### 7.3 Εντολή για να δούμε τα στοιχεία ενός CV

Για να δούμε όλα τα στοιχεία μιας ΚΕ (CV) πρέπει να στείλουμε την εντολή GET μαζί με τον id αριθμό του CV στο τέλος της διεύθυνσης όπως φαίνεται στο πιο κάτω παράδειγμα.

<https://visit-api.chrysochos.net/api/74.

Αν δεν έχετε τον id αριθμό της ΚΕ, μπορείτε να τον βρείτε με την εντολή GET στην διεύθυνση <https://visit-api.chrysochos.net/api/ όπου θα δείτε την λίστα των ΚΕ.

Στο δεδομένα του response θα δείτε όλα τα στοιχεία μιας ΚΕ. Να σημειωθεί ότι οι ΚΕ που αφορούν τεχνικές εργασίες έχουν διαφορετικά πεδία από αυτές των survey. Όμως όλα τα στοιχεία και των δύο κατηγοριών καταγράφονται στην ίδια γραμμή. Γι' αυτό τα στοιχεία της επιτόπου συνάντησης θα πρέπει να διαβάζονται ανάλογα με τον τύπο (cv_type) της ΚΕ. 

Το UI θα πρέπει να τα ξεχωρίζει τους τύπους της ΚΕ για να παρουσιάζει τα δεδομένα που αναλογούν στον κάθε τύπο μόνο. 

Οι Πάροχοι δεν θα βλέπουν το onsite χρήστη της Cyta, και αυτό γίνεται διότι είναι αυτός που θα τηλεφωνήσει στο συνεργείο του Παρόχου για την ΚΕ. <span style="color:red">Αυτό πρέπει να γίνει και στο UI. Στο API θα βλέπουν το id του; Μήπως μόνο στο completed, ή καθόλου;</span>

## 8. Εντολές για την Αλλαγή Κατάστασης ενός CV

Μετά την δημιουργία ενός CV, υπάρχουν εντολές που αλλάζουν την κατάσταση (status) του. Οι εντολές αυτές είναι PATCH. Δηλαδή τροποποιούν μέρος του CV. Οι εντολές που μπορεί να σταλούν είναι.

    1.  accept
    2.  reject
    3.  cancel
    4.  propose_date
    5.  change_date
    6.  set_user
    7.  execute
    8.  complete
    9.  site_tech
    10. site_survey

Η κάθε μια εντολή πρέπει να συνοδεύεται από διαφορετικά δεδομένα στο body του request, όπως μπορείτε να δείτε στην τεκμηρίωση <https://visit-api.chrysochos.net/api/schema/redoc/. Στην τεκμηρίωση αυτή μπορείτε να δείτε τις εντολές και τα δεδομένα που πρέπει να σταλούν στο body του request για να αλλάξει η κατάσταση της ΚΕ. Δεν δείχνονται ποια πεδία είναι υποχρεωτικά. Ενδεχόμενα να χρειάζεται μια πρόσθετη περιγραφή. Όμως όταν αποστείλετε την εντολή θα πάρετε την ανάλογη απάντηση από το σύστημα και θα σας ενημερώσει αν κάτι είναι υποχρεωτικό. 

Η μορφή του url για τις πιο πάνω εντολές είναι {{url}}/api/όνομα_εντολής/αριθμός_KE. Για παράδειγμα, για να γίνει complete η ΚΕ με αριθμό 40, πρέπει να σταλεί η εντολή <https://visit-api.chrysochos.net/api/complete/40.

Στην συνέχεια επεξηγούνται οι εντολές για να φανεί πως αλλάζει ο κύκλος ζωής μια ΚΕ, που ουσιαστικά είναι και η λογική του συστήματος.

### 8.1. Accept

Ένας χρήστης του Acceptor μπορεί να δει και να κάνει accept μια ΚΕ με βάση τον αύξοντα αριθμό της.

### 8.2. Reject

Η εντολή Reject μαζί με τον αύξοντα αριθμό μιας ΚΕ αποστέλλεται από τον Requestor σε όλα τα στάδια εκτός από τα τελικά που είναι το Canceled, Rejected και Completed.

### 8.3. Cancel

Η εντολή Canceled μαζί με τον αύξοντα αριθμό μιας ΚΕ αποστέλλεται από τον Requestor σε όλα τα στάδια εκτός από τα τελικά που είναι το Canceled, Rejected και Completed.

### 8.4. Propose Data

Μόνο ο Πάροχος που είναι Acceptor ή Requestor της ΚΕ μπορεί να ζητήσει αλλαγή ημερομηνίας. Με το που γίνεται το συγκεκριμένο αίτημα η ΚΕ πηγαίνει σε κατάσταση DateExam. Η Cyta εξετάζει όλα τα αιτήματα και μπορεί να κάνει Change Date.

Η ΚΕ πρέπει να βρίσκεται σε μια από τις καταστάσεις Pending, Accepted και DateExam.

Η ημερομηνία πρέπει να είναι μεγαλύτερη από την σημερινή.

### 8.5. Change Data

Μόνο η Cyta μπορεί να στείλει την εντολή αυτή είτε γιατί θέλει η ίδια να αλλάξει μια ημερομηνία ή εξετάζει κάποιο αίτημα του Παρόχου. Η ημερομηνία πρέπει να είναι μεγαλύτερη ή ίση με την σημερινή.

Η διαδικασία αλλαγής γίνεται όταν η ΚΕ βρίσκεται σε κατάσταση Pending, Accepted και DateExam. Δεν γίνεται αλλαγή ημερομηνίας όταν η ΚΕ βρίσκεται σε τελική κατάσταση όπως είναι το Canceled, Rejected και Completed αλλά ούτε κατά την διάρκεια του Execution.

### 8.6. Set User

O Requestor μπορεί να αλλάξει το όνομα του συνεργείου του όποτε θέλε εκτός αν η ΚΕ βρίσκεται σε τελική κατάσταση που είναι το Canceled, Rejected και Completed.

O Acceptor μπορεί να αλλάξει το όνομα του συνεργείου του όποτε θέλε εκτός αν η ΚΕ βρίσκεται σε τελική κατάσταση που είναι το Canceled, Rejected και Completed.

Η εντολή αυτή θέλει προσοχή διότι είναι η ίδια τόσο για τον Requestor όσο και τον Acceptor και διαφέρουν μόνο τα στοιχεία στο body της.

### 8.7. Execute

Το Execute θα γίνεται αυτόματα κάθε πρωί για να αποδεσμεύει τις ΚΕ που έχουν και από τις δύο πλευρές ονόματα, κινητά και email συνεργείων.

Το execute που γίνεται για συγκεκριμένο CV εξετάζει το CV και αν δεν έχει cv_date ή αν αυτό έχει παλαιότερη ημερομηνία, και του βάζει την σημερινή ημερομηνία. Αυτό γίνεται και στις ιστοσελίδες. <span style="color:red"> Καλό είναι να διορθώνεται η ημερομηνία με τον ίδιο τρόπο και στα accepted CVs όταν θα τρέχει το γενικό execute για όλες τα ανοιχτά CV, είτε αυτόματα κάθε πρωί ή με την API εντολή.


### 8.8. Site_tech και Site_survey

Οι Site εντολές αποστέλλονται με PATCH. Για παράδειγμα το να στείλουμε τα δεδομένα της ΚΕ 40 αν αυτή είναι survey θα κάνουμε PATCH στην διεύθυνση <https://visit-api.chrysochos.net/api/site_survey/40. Οι site εντολές δεν αλλάζουν την κατάσταση της ΚΕ και μπορούν να δίνονται πέραν της μιας φοράς πριν το Complete.
Προσοχή η εντολή και τα δεδομένα που θα στέλνονται να είναι ανάλογα με τον τύπο (cv_type) της ΚΕ. 
<span sytly="color:red">Οι εντολές αυτές αποστέλλονται μόνο από τον onsite τεχνικό της Cyta που η ταυτότητά του βρίσκεται στο CV. Αυτό θα υλοποιηθεί αφού προηγούμενα χρησιμοποιηθούν τα user_id στο CV.</span>

### 8.9. Complete

Το Complete αποστέλλεται όταν ολοκληρωθεί η επιτόπου επίσκεψη και έχει συμπληρωθεί το CV. Για να γίνει αποδεχτό το Complete, πρέπει η προηγούμενη κατάσταση να είναι Execution και να είναι συμπληρωμένα τα απαραίτητα στοιχεία με βάση τον τύπο της ΚΕ.

Να σημειωθεί ότι τόσο οι Τεχνικές ΚΕ όσο και αυτές των Survey καταγράφονται στον ίδιο πίνακα ΚΕ (CV). Θα δούμε όταν συμπληρώνουμε μια CV φόρμα με τα αποτελέσματα μιας επιτόπου συνάντησης πως να προσέξουμε να στείλουμε τα ορθά δεδομένα.


## 9. Σημειώσεις:


1. Πρέπει τόσο στο API όσο και στο UI να μην βλέπει ο Πάροχος τον χρήστης της Cyta, ούτε ακόμη και στα completed?


## 10. Δημιουργία νέας βάσης δεδομένων

Διαγράφουμε την υφιστάμενη βάση δεδομένων και ξεκινούμε από μια άδεια βάση χωρίς πίνακες.

Εκτελούμε διαδοχικά τις πιο κάτω εντολές:

	cd /home/john/code/myproject
	source venv/bin/activate
    cd /home/john/code/myproject/base/migrations
    Διαγράψτε το περιεχόμενο του directory base/migrations
    Δημιουργήστε σε αυτό ένα άδειο αρχείο με όνομα __init__.py
    cd /home/john/code/myproject
	python manage.py makemigrations
	python manage.py migrate
	python populate_initial_data.py
	python manage.py createsuperuser

Από τον Browser πηγαίνουμε στην διεύθυνση του συστήματος που είναι http://127.0.0.1:8000/  ή visit-api.chrysochos.net

